In [1]:
people = {
    'first':['Corey', 'Jane', 'John'],
    'last':['Schafer', 'Doe', 'Smith'],
    'email':['coreyMs@gmail.com', 'janeDoe@gmail.com', 'johnSmith@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                email
0  Corey  Schafer    coreyMs@gmail.com
1   Jane      Doe    janeDoe@gmail.com
2   John    Smith  johnSmith@gmail.com

In [5]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2       John Smith
dtype: object

In [6]:
df['full_name']  = df['first'] + ' ' + df['last']

In [7]:
df

   first     last                email      full_name
0  Corey  Schafer    coreyMs@gmail.com  Corey Schafer
1   Jane      Doe    janeDoe@gmail.com       Jane Doe
2   John    Smith  johnSmith@gmail.com     John Smith

In [10]:
df.drop(columns=['first', 'last'], inplace=True)

In [11]:
df

                 email      full_name
0    coreyMs@gmail.com  Corey Schafer
1    janeDoe@gmail.com       Jane Doe
2  johnSmith@gmail.com     John Smith

In [12]:
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2       [John, Smith]
Name: full_name, dtype: object

In [13]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John    Smith

In [14]:
df

                 email      full_name
0    coreyMs@gmail.com  Corey Schafer
1    janeDoe@gmail.com       Jane Doe
2  johnSmith@gmail.com     John Smith

In [15]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [16]:
df

                 email      full_name  first     last
0    coreyMs@gmail.com  Corey Schafer  Corey  Schafer
1    janeDoe@gmail.com       Jane Doe   Jane      Doe
2  johnSmith@gmail.com     John Smith   John    Smith

In [21]:
df.append({'first':'Tony'}, ignore_index=True)

                 email      full_name  first     last
0    coreyMs@gmail.com  Corey Schafer  Corey  Schafer
1    janeDoe@gmail.com       Jane Doe   Jane      Doe
2  johnSmith@gmail.com     John Smith   John    Smith
3                  NaN            NaN   Tony      NaN

In [18]:
df

                 email      full_name  first     last
0    coreyMs@gmail.com  Corey Schafer  Corey  Schafer
1    janeDoe@gmail.com       Jane Doe   Jane      Doe
2  johnSmith@gmail.com     John Smith   John    Smith

In [22]:
people = {
    'first':['Tony', 'Steve'],
    'last':['Stark', 'Rogers'],
    'email':['ironman@avange.com', 'Cap@avange.com']
}
df2 = pd.DataFrame(people)

In [23]:
df2

   first    last               email
0   Tony   Stark  ironman@avange.com
1  Steve  Rogers      Cap@avange.com

In [25]:
df.append(df2, ignore_index=True)

                 email      full_name  first     last
0    coreyMs@gmail.com  Corey Schafer  Corey  Schafer
1    janeDoe@gmail.com       Jane Doe   Jane      Doe
2  johnSmith@gmail.com     John Smith   John    Smith
3   ironman@avange.com            NaN   Tony    Stark
4       Cap@avange.com            NaN  Steve   Rogers

In [26]:
df = df.append(df2, ignore_index=True)

In [27]:
df

                 email      full_name  first     last
0    coreyMs@gmail.com  Corey Schafer  Corey  Schafer
1    janeDoe@gmail.com       Jane Doe   Jane      Doe
2  johnSmith@gmail.com     John Smith   John    Smith
3   ironman@avange.com            NaN   Tony    Stark
4       Cap@avange.com            NaN  Steve   Rogers

In [28]:
df.drop(index=4)

                 email      full_name  first     last
0    coreyMs@gmail.com  Corey Schafer  Corey  Schafer
1    janeDoe@gmail.com       Jane Doe   Jane      Doe
2  johnSmith@gmail.com     John Smith   John    Smith
3   ironman@avange.com            NaN   Tony    Stark

In [30]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                 email      full_name  first     last
0    coreyMs@gmail.com  Corey Schafer  Corey  Schafer
2  johnSmith@gmail.com     John Smith   John    Smith
3   ironman@avange.com            NaN   Tony    Stark
4       Cap@avange.com            NaN  Steve   Rogers